Revit 2025 API
ProfileFamilyUsage Enumeration
 An enumerated type listing all types of profile families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ProfileFamilyUsage
Public Enumeration ProfileFamilyUsage
public enum class ProfileFamilyUsage
type ProfileFamilyUsage
Members
Member name | Value | Description
Any | 0 |  Any type of profile family.
WallSweep | 1 |  Wall sweep.
Reveal | 2 |  Reveal.
Fascia | 3 |  Fascia.
Gutter | 4 |  Gutter.
SlabEdge | 5 |  Slab edge.
Railing | 6 |  Railing.
StairNosing | 7 |  Stair Nosing.
Mullion | 8 |  Mullion.
SlabMetalDeck | 9 |  Slab Metal Deck.
ContinuousFooting | 10 |  Continuous Footing.
StairTread | 11 |  Stair Tread.
StairRiser | 12 |  Stair Riser.
StairSupport | 13 |  Stair Support.
See Also
Reference
Autodesk.Revit.DB Namespace